<a href="https://colab.research.google.com/github/jimmy-io/worksheeets-/blob/master/01_Getting_%26_Knowing_Your_Data_Chipotle_Exercise_with_Solutions.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np

In [0]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv'
    
chipo = pd.read_csv(url, sep = '\t')

In [3]:
chipo.head()

   order_id  ...  item_price
0         1  ...      $2.39
1         1  ...      $3.39
2         1  ...      $3.39
3         1  ...      $2.39
4         2  ...     $16.98

[5 rows x 5 columns]

In [4]:
chipo.size

23110

In [5]:
chipo.shape

(4622, 5)

In [7]:
chipo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

In [8]:
chipo.columns

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

In [9]:
chipo.index

RangeIndex(start=0, stop=4622, step=1)

In [14]:
## Step 9. Which was the most-ordered item?

chipo.groupby('item_name').sum().sort_values(['quantity'], ascending = False).head(1)

              order_id  quantity
item_name
Chicken Bowl    713926       761

In [16]:
## Step 10. For the most-ordered item, how many items were ordered?

chipo.groupby('item_name').sum().sort_values(['quantity'], ascending = False).head(1)

              order_id  quantity
item_name
Chicken Bowl    713926       761

In [21]:
## Step 11. What was the most ordered item in the choice_description column?

chipo.groupby('choice_description').sum().sort_values(['quantity'], ascending = False).head(1)

                    order_id  quantity
choice_description
[Diet Coke]           123455       159

In [24]:
## Step 12. How many items were orderd in total? 

chipo.quantity.sum()

4972

In [25]:
##Step 13. Turn the item price into a float

chipo.item_price.dtype

dtype('O')

In [0]:
dollarizer = lambda x: float(x[1:-1])
chipo.item_price = chipo.item_price.apply(dollarizer)
chipo.item_price.dtype

In [31]:
## How much was the revenue for the period in the dataset?

(chipo['quantity']*chipo['item_price']).sum()

39237.02

In [34]:
## Step 15. How many orders were made in the period?

chipo.order_id.max()

1834

In [37]:
## Step 16. What is the average revenue amount per order?

chipo['revenue'] = chipo['item_price']*chipo['quantity']
chipo.head()

   order_id  quantity  ... item_price revenue
0         1         1  ...       2.39    2.39
1         1         1  ...       3.39    3.39
2         1         1  ...       3.39    3.39
3         1         1  ...       2.39    2.39
4         2         2  ...      16.98   33.96

[5 rows x 6 columns]

In [42]:
chipo_grouped = chipo.groupby('order_id').sum()
chipo_grouped.head()

          quantity  item_price  revenue
order_id
1                4       11.56    11.56
2                2       16.98    33.96
3                2       12.67    12.67
4                2       21.00    21.00
5                2       13.70    13.70

In [46]:
chipo_grouped.revenue.mean()

21.394231188658654

In [51]:
## How many different items are sold?

chipo.item_name.value_counts().count()

50